from langchain.prompts import (
    AIMessagePromptTemplate,
    HumanMessagePromptTemplate,
)

few_shot_human2 = '''
通过基金销售机构及公司直销中心(含网上直销系统)首次申购或追加申购各类基金份额时,单笔最低金额为人民币0.01元(含申购费)
'''
few_shot_human_template2 = HumanMessagePromptTemplate.from_template(few_shot_human2)


few_shot_ai2 = '''
[
			{
				"限额项目": "申购最低额",
				"销售方式": "销售机构/直销中心/网上直销系统",
				"是否含申购费": "含",
				"金额数": "0.01",
				"单位": "元"
			},
			{
				"限额项目": "追加申购最低额",
				"销售方式": "销售机构/直销中心/网上直销系统",
				"是否含申购费": "含",
				"金额数": "0.01",
				"单位": "元"
			}
		]
	},
	{
		"User": "1、在基金管理人直销中心(柜台)进行申购时,投资人以金额申请,每个基金账户首\n笔申购的最低金额为人民币10万元(含申购费),每笔追加申购的最低金额为人民币\n10万元(含申购费)。在基金管理人网上直销系统进行申购时,投资人以金额申请,每个\n基金账户首笔申购的最低金额为人民币10元(含申购费),每笔追加申购的最低金额为人民\n币10元(含申购费)。除上述情况及另有公告外,基金管理人规定本基金的单笔申购、追加\n申购起点金额为0.1元(含申购费),在本基金其他销售机构进行申购时,具体办理要求以\n相关销售机构的交易细则为准,但不得低于基金管理人规定的最低限额。",
		"Assistant": [
			{
				"限额项目": "申购最低额",
				"销售方式": "直销中心柜台",
				"是否含申购费": "含",
				"金额数": "10万",
				"单位": "元"
			},
			{
				"限额项目": "追加申购最低额",
				"销售方式": "直销中心柜台",
				"是否含申购费": "含",
				"金额数": "10万",
				"单位": "元"
			},
			{
				"限额项目": "申购最低额",
				"销售方式": "网上直销系统",
				"是否含申购费": "含",
				"金额数": "10",
				"单位": "元"
			},
			{
				"限额项目": "追加申购最低额",
				"销售方式": "网上直销系统",
				"是否含申购费": "含",
				"金额数": "10",
				"单位": "元"
			},
			{
				"限额项目": "申购最低额",
				"销售方式": "其他销售机构",
				"是否含申购费": "含",
				"金额数": "0.1",
				"单位": "元"
			},
			{
				"限额项目": "追加申购最低额",
				"销售方式": "其他销售机构",
				"是否含申购费": "含",
				"金额数": "0.1",
				"单位": "元"
			}
		]
'''
few_shot_ai_template2 = AIMessagePromptTemplate.from_template(few_shot_ai2)